bl-backend/app/controllers/buckets_controller.rb

  def index
    @buckets = Bucket.all
---
SELECT "buckets".* FROM "buckets"

  def create
    @bucket = Bucket.new(bucket_params)

    if @bucket.save
---
INSERT INTO "buckets" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Education"], ["created_at", "2021-01-07 22:44:41.158046"], ["updated_at", "2021-01-07 22:44:41.158046"]]

  def destroy
    @bucket.destroy
---
DELETE FROM "buckets" WHERE "buckets"."id" = ?  [["id", 2]]

    def set_bucket
      @bucket = Bucket.find(params[:id])
---
SELECT "buckets".* FROM "buckets" WHERE "buckets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]