bl-backend/app/controllers/things_controller.rb

SELECT "things".* FROM "things"
---
  def index
    @things = Thing.all

INSERT INTO "things" ("description", "bucket_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Learn Python"], ["bucket_id", 7], ["created_at", "2021-01-08 20:28:39.264024"], ["updated_at", "2021-01-08 20:28:39.264024"]]
---
  def create
    @thing = Thing.new(thing_params)

    if @thing.save

DELETE FROM "things" WHERE "things"."id" = ?  [["id", 3]]
---
  def destroy
    @thing.destroy

SELECT "things".* FROM "things" WHERE "things"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_thing
      @thing = Thing.find(params[:id])